week_2/quiz_2.tex
% Created 2024-07-06 Sat 10:49
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=1cm,right=1cm,top=1cm,bottom=1cm]{geometry}
\usepackage[american, english]{babel}
\usepackage{enumitem}
\usepackage{float}
\usepackage[sc]{mathpazo}
\linespread{1.05}
\renewcommand{\labelitemi}{$\rhd$}
\setlength\parindent{0pt}
\setlist[itemize]{leftmargin=*}
\setlist{nosep}
\date{}
\title{Week 2 Quiz}
\hypersetup{
 pdfauthor={Marcio Woitek},
 pdftitle={Week 2 Quiz},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\thispagestyle{empty}
\pagestyle{empty}
\section*{Problem 1}
\label{sec:orgcd3bf99}

\textbf{Answer:} Project B\\

We begin by summarizing the relevant information in the problem statement. For
project A, we have the following:
\begin{itemize}
\item the value of the initial investment is \$1,000;
\item the value of the annual income is \$500.
\end{itemize}
The data related to project B is the following:
\begin{itemize}
\item the value of the initial investment is \$2,000;
\item the value of the annual income is \$900.
\end{itemize}
In both cases, the discount rate is \(r=0.05\), and the number of time periods
is \(t=3\) years.\\
First, we compute the NPV for project A. In this case, the NPV can be expressed as
\begin{equation}
\mathrm{NPV}_A=-1000+\sum_{t=1}^3\frac{500}{(1+0.05)^t}=-1000+500\sum_{t=1}^3\frac{1}{1.05^t}\approx 361.62.
\end{equation}
Therefore, the net present value for project A is \$361.62. Next, consider the
NPV for project B. This amount can be computed as follows:
\begin{equation}
\mathrm{NPV}_B=-2000+\sum_{t=1}^3\frac{900}{(1+0.05)^t}=-2000+900\sum_{t=1}^3\frac{1}{1.05^t}\approx 450.92.
\end{equation}
Since this amount is greater than \(\mathrm{NPV}_A\), it's better to select
project B.
\section*{Problem 2}
\label{sec:org3f65365}

\textbf{Answer:} Project A\\

First, consider project A. In this case, it's clear that we get the initial
investment back in two years. On the other hand, for project B, in the same
period we would get back only \$1,800, which is less than the initial investment.
Then the payback period of B is greater than 2 years. Therefore, based on
payback period, we should select project A.
\section*{Problem 3}
\label{sec:org364b35f}

\textbf{Answer:} NPV decreases\\

If the initial investment increases, then we subtract a larger number from the
present value of the cash flows. Assuming this PV doesn't change, we get a
smaller difference as a result. Therefore, the NPV decreases.
\section*{Problem 4}
\label{sec:org9760b6e}

\textbf{Answer:} NPV decreases
\section*{Problem 5}
\label{sec:org74cc7c4}

\textbf{Answer:} IRR decreases\\

To answer this question, we're going to compute the IRR in both cases. In the
first case, the NPV can be written as follows:
\begin{equation}
\mathrm{NPV}_1=-1000+\frac{50}{(1+r_1)^1}+\frac{50}{(1+r_1)^2}+\frac{1000}{(1+r_1)^2},
\end{equation}
where \(r_1\) denotes the discount rate in case 1. By definition, this
quantity becomes the IRR when \(\mathrm{NPV}_1=0\). By imposing this
condition, we get
\begin{equation}
\frac{50}{1+\mathrm{IRR}_1}+\frac{1050}{(1+\mathrm{IRR}_1)^2}=1000.
\end{equation}
To actually compute \(\mathrm{IRR}_1\), first we need to re-write this
equation:
\begin{align}
  \begin{split}
    \frac{50}{1+\mathrm{IRR}_1}+\frac{1050}{(1+\mathrm{IRR}_1)^2}&=1000\\
    \frac{1}{1+\mathrm{IRR}_1}+\frac{21}{(1+\mathrm{IRR}_1)^2}&=20\\
    (1+\mathrm{IRR}_1)^2\left[\frac{1}{1+\mathrm{IRR}_1}+\frac{21}{(1+\mathrm{IRR}_1)^2}\right]&=20(1+\mathrm{IRR}_1)^2\\
    1+\mathrm{IRR}_1+21&=20(1+\mathrm{IRR}_1)^2\\
    \mathrm{IRR}_1+22&=20(1+2\mathrm{IRR}_1+\mathrm{IRR}_1^2)\\
    \mathrm{IRR}_1+22&=20+40\mathrm{IRR}_1+20\mathrm{IRR}_1^2\\
    20\mathrm{IRR}_1^2+39\mathrm{IRR}_1-2&=0
  \end{split}
\end{align}
The above equation can be solved easily with the aid of the quadratic formula.
One can show that this equation has two solutions: \(\mathrm{IRR}_1=-2\) and
\(\mathrm{IRR}_1=\frac{1}{20}\). A discount rate is a strictly positive
number. Then the negative root isn't a valid solution. This allows us to
conclude that
\begin{equation}
\mathrm{IRR}_1=\frac{1}{20}=0.05.
\end{equation}
In other words, in the first case, the internal rate of return is 5\%.\\
To obtain the IRR in the second case, we can follow a similar procedure. For
this reason, we won't present a detailed explanation. Instead, we'll simply
write down the important results. It's straightforward to show that
\(\mathrm{IRR}_2\) satisfies the following quadratic equation:
\begin{equation}
25\mathrm{IRR}_2^{2}+49\mathrm{IRR}_2-2=0.
\end{equation}
With the aid of the quadratic formula, it's simple to prove that the solutions
to the above equation are \(-2\) and \(0.04\). Once again, we discard the
negative root. Then we have \(\mathrm{IRR}_2=0.04\). This clearly shows that
the IRR decreases.
\section*{Problem 6}
\label{sec:org8777024}

\textbf{Answer:} IRR decreases\\

The initial situation is the same as in the previous problem. If we increase the
investment to \$1,050, the IRR is the positive solution to the following
equation:
\begin{equation}
21\mathrm{IRR}_3^{2}+41\mathrm{IRR}_3-1=0.
\end{equation}
Once again, it's possible to show that this equation has two real roots, one
negative and the other positive. This positive root is given approximately by
\(\mathrm{IRR}_3\approx 0.024\). This value is close to half the original one.
Therefore, as in the previous problem, the IRR decreases.
\section*{Problem 7}
\label{sec:org4032704}

\textbf{Answer:} ROI doubles\\

It's very clear that the return doubles when the annual incomes double. As a
consequence, the ROI also doubles.
\end{document}
